Revit 2026 API

# PointElementReference Class

---

Base class for objects defining a way to constrain a ReferencePoint to one or more other objects in a document.

SystemObject Autodesk.Revit.DBPointElementReference More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class PointElementReference
```
```vb
Public MustInherit Class PointElementReference
```
```cpp
public ref class PointElementReference abstract
```
```fsharp
[<AbstractClassAttribute>]
type PointElementReference = class end
```

The PointElementReference type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBPointElementReference Autodesk.Revit.DBPointOnEdge Autodesk.Revit.DBPointOnEdgeEdgeIntersection Autodesk.Revit.DBPointOnEdgeFaceIntersection Autodesk.Revit.DBPointOnFace Autodesk.Revit.DBPointOnPlane Autodesk.Revit.DBPointRelativeToPoint